class DuaItem{
  String title;
  String description;
  String data;
  DuaItem({required this.title, this.description = "", required this.data});
}
List<DuaItem> duaItems = [
  DuaItem(
    title: "Dua_Travel",
    data: """
    بسم الله والحمد لله، الله أكبر، الله أكبر، الله أكبر
    سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ
    اللهُمَّ إِنَّا نَسْأَلُكَ فِي سَفَرِنَا هَذَا الْبِرَّ وَالتَّقْوَى
    وَمِنَ الْعَمَلِ مَا تَرْضَى
    اللهُمَّ هَوِّنْ عَلَيْنَا سَفَرَنَا هَذَا، وَاطْوِ عَنَّا بُعْدَهُ
    اللهُمَّ أَنْتَ الصَّاحِبُ فِي السَّفَر، وَالْخَلِيفَةُ فِي الْأَهْلِ
    اللهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ، وَكَآبَةِ الْمَنْظَرِ
    وَسُوءِ الْمُنْقَلَبِ فِي الْمَالِ وَالْأَهْلِ والولد
    
    
    
    وكان إذا رجع قالهن وزاد فيهن قائلًا أيِبُونَ تَائِبُونَ عَابِدُونَ لِرَبِّنَا حَامِدُون
    """
  ),
  DuaItem(
      title: "Dua_Ihram",
      data: """
    بعد صلاة ركعتي الإحرام أو صلاة الفريضة تُحْرِمُ ناويا العمرة وتقول
    «لَبَّيْكَ اللَّهُمَّ عُمْرَةً)»
وتشرع بعد الإحرام في التلبية قائلا    
 «لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ ،لَبَّيْكَ لاَ شَرِيكَ لَكَ لَبَّيْكَ، إِنَّ الْحَمْدَ وَالنِّعْمَةَ لَكَ وَالْمُلْكَ، لاَ شَرِيكَ لَكَ»   
    """
  ),
  DuaItem(
      title: "Dua_Kaaba_Way",
      data: """
    لبيك اللهم لبيك، لبيك لا شريك لك لبيك، أن الحمد والنعمة لك والملك لا شريك لك  
    """
  ),
  DuaItem(
      title: "Dua_Makkah_Entrance",
      data: """
    «اللَّهُمَّ لَا تَجْعَلْ مَنَايَانَا بِهَا حَتَّى تُخْرِجَنَا مِنْهَا » 
    
«اللَّهُمَّ هَذَا حرمك وأمْنُكَ فحرمنى على النار، وأمنِّى مِن عَذَابِكَ يَومَ تَبْعَثُ عِبادَكَ، وَاجْعَلْنِى مِن أوليائِكَ وَأَهْلِ طَاعَتِكَ»، ويدعُو بما أحب     
    """
  ),
  DuaItem(
      title: "Dua_Kaaba_Entrance",
      data: """
    أدخل المسجد برجلك اليمنى وقل
    أَعُوذُ بِاَللَّهِ مِنْ الشَّيْطَانِ الرَّجِيمِ، اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ، اللَّهُمَّ اغْفِرْ لِي ذُنُوبِي وَافْتَحْ لِي أَبْوَابَ رَحْمَتِك
وعند رؤية البيت ادعو الله قائلا    
 اللَّهُمَّ زِدْ هَذَا البَيْتَ تَشْرِيفاً وَتَكْرِيماً وَتَعْظِيماً وَمَهابَةً، وزِدْ مَنْ شَرَّفَهُ وكَرَّمَهُ مِمَّنْ حَجَّهُ واعْتَمَرَهُ تَشْرِيفاً وَتَكْرِيماً وَتَعْظِيماً وبِرًّا   
اللَّهُمَّ أَنتَ السَّلامُ، وَمِنْكَ السَّلامُ، فَحَيِّنَا ربَّنَا بالسَّلامُ    
    """
  ),
  DuaItem(
      title: "Dua_Tawaaf_Beginning",
      data: """
    «بسم الله، واللهُ أَكْبَرُ ؛ اللَّهُمَّ إِيمَانًا بِكَ، وَتَصْدِيقًا بِكِتَابِكَ، وَوَفاءً بِعَهْدِكَ، وَاتَّبَاعًا لِسُنَّةِ نَبِيِّكَ صَلَّى اللَّهُ عَلَيْهِ وَعَلَى آلِهِ وَسَلَّمَ » 
     ويُستحب أن يكرّر هذا الذكر عند محاذاة الحجر الأسود فى كل طوفة
    """
  ),
  DuaItem(
      title: "Dua_BlackRock_Acquiring",
      data: """
    بِسْمِ اللهِ وَاللَّهُ أَكْبَرُ، لَا إِلَهَ إِلَّا اللهُ وَاللَّهُ أَكْبَرُ، اللَّهُمَّ تَصْدِيقًا بِكِتَابِكَ، وَسُنَّةِ نَبِيِّكَ صَلَّى اللَّهُ عَلَيْهِ وَعَلَى آلِهِ وَسَلَّمَ
    """
  ),
  DuaItem(
      title: "Dua_Tawaaf_Stages",
      data: """
      تبتدئ بالحجر الأسود وتنتهي إليه، تُسَلِّم على الحجر الأسود أو تشير إليه بيدك اليمنى وتقول
      بِاسْم اللَّهِ، وَاللَّهُ أكْبَرُ، اللَّهُمَّ إِيماناً بِكَ، وَتَصْدِيقاً بِكِتَابِكَ وَوَفَاءً بِعَهْدِكَ، وَاتِّبَاعًا لِسُنَّةِ نَبِيِّكَ مُحَمَّدٍ صلى الله عليه وسلم
      بين الركن اليماني والحجر الأسود
      رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارَِ
      اكثر من الدعاء والذكر، ومن الدعاء أن تقول
      اللَّهُمَّ اغفِرْ وَارْحَمْ وَاعْفُ عَمَا تعْلَمُ فَإِنَّكَ الأعَزُّ الأكْرَمُ
  رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً، وَفِي الْآخِرَةِ حَسَنَةً، وَقِنَا عَذَابَ النَّارِ    
  اللَّهُمَّ اجْعَلْهُ حَجًّا مَبْرُورًا، وَذَنْبًا مَغْفُورًا، وَسَعْيًا مَشْكُورًا    
  فإذا فرغت من طوافك استقبل الملتزم و ادع بما شئت ثم صَلِّ خلف المقام إن أمكنك ركعتين    
   وإلا فصلّ حيث تيسر لك من المسجد، تقرأ فيهما مع أم القرآن بسورة الكافرون والإخلاص، وإن قرأت بغيرهما فلا حرج   
    """
  ),
  DuaItem(
      title: "Dua_Zamzam_Water",
      data: """
    اللهم إنى أسألك علما نافعًا، ورزقا واسعا، وشفاء من كل داء
     """
  ),
  DuaItem(
      title: "Dua_Safa_Arrival",
      data: """
    اللَّهُ أَكْبَرُ ـ ثلاثا ـ، لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ، أَنْجَزَ وَعْدَهُ، وَنَصَرَ عَبْدَهُ، وَهَزَمَ الْأَحْزَابَ وَحْدَهُ
    
    لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ، وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ثَلَاثَ مَرَّاتٍ
    
    «اللَّهُمَّ اعْصِمْنَا بِدِينِكَ، وَطَوَاعِيَتِكَ، وَطَوَاعِيَةِ رَسُولِكَ، وَجَنِّبْنَا حُدُودَكَ»
    
    اللَّهُمَّ اجْعَلْنَا نُحِبُّكَ، وَنُحِبُّ مَلَائِكَتَكَ، وَأَنْبِيَاءَكَ، وَرُسُلَكَ، وَنُحِبُّ عِبَادَكَ الصَّالِحِين
    
    اللَّهُمَّ حَبِّيْنَا إِلَيْكَ وَإِلَى مَلَائِكَتِكَ، وَإِلَى أَنْبِيَائِكَ، وَرُسُلِكَ، وَإِلَى عِبَادِكَ الصَّالِحِينَ. اللَّهُمَّ يَسِّرْنَا لِلْيُسْرَى، وَجَنِّبْنَا وَجَنِّبْنَا الْعُسْرَى، وَاغْفِرْ لَنَا فِى الْآخِرَةِ
     
    اللهُمَّ اعْصِمْنِى بِدِينِكَ وَطَوَاعِيَتِكَ وَطَوَاعِيَةِ رَسُولِكَ، اللهُمَّ جَنَّبْنِى حُدُودَكَ، اللهُمَّ اجْعَلْنِى مِمَّنْ يُحِبُّكَ، وَيُحِبُّ مَلَائِكَتَكَ، وَيُحِبُّ - رُسُلَكَ، وَيُحِبُّ عِبَادَكَ الصَّالِحِينَ
    اللهُمَّ حَبِّبْنِى إِلَيْكَ، وَإِلَى مَلَائِكَتِكَ، وَإِلَى رُسُلِكَ، وَإِلَى عِبَادِكَ الصَّالِحِينَ
    اللهُمَّ يَسِّرْنِى لِلْيُسْرَى، وَجَنِّبْنِى الْعُسْرَى، وَاغْفِرْ لِى فِى الْآخِرَةِ وَالْأُولَى
    وَاجْعَلْنِى مِنْ أَئِمَّةِ الْمُتَّقِينَ، اللهُمَّ إِنَّكَ قُلْتَ: ﴿ ادْعُونِى أَسْتَجِبْ لَكُمْ ﴾ [غافر: ٦٠]
    وَإِنَّكَ لَا تُخْلِفُ الْمِيعَادَ، اللهُمَّ إِذْ هَدَيْتَنِى لِلْإِسْلَامِ فَلَا تَنْزِعْنِى مِنْهُ، وَلَا تَنْزِعْهُ مِنِّى حَتَّى تَقْبِضَنِى وَأَنَا عَلَيْهِ
     """
  ),
  DuaItem(
      title: "Dua_Marwa_Arrival",
      data: """
      اللهُمَّ اعْصِمْنِى بِدِينِكَ وَطَوَاعِيَتِكَ وَطَوَاعِيَةِ رَسُولِكَ، اللهُمَّ جَنَّبْنِى حُدُودَكَ، اللهُمَّ اجْعَلْنِى مِمَّنْ يُحِبُّكَ، وَيُحِبُّ مَلَائِكَتَكَ، وَيُحِبُّ رُسُلَكَ، وَيُحِبُّ عِبَادَكَ الصَّالِحِينَ
      اللهُمَّ حَبَّيْنِى إِلَيْكَ، وَإِلَى مَلَائِكَتِكَ، وَإِلَى رُسُلِكَ، وَإِلَى عِبَادِكَ الصَّالِحِينَ
      اللهُمَّ يَسِّرْنِى لِلْيُسْرَى، وَجَنِّبْنِى الْعُسْرَى، وَاغْفِرْ لِى فِى الْآخِرَةِ وَالْأُولَى
      وَاجْعَلْنِى مِنْ أَئِمَّةِ الْمُتَّقِينَ، اللهُمَّ إِنَّكَ قُلْتَ: ﴿ادْعُونِى أَسْتَجِبْ لَكُمْ ﴾ [غافر: ٦٠]
      وَإِنَّكَ لَا تُخْلِفُ الْمِيعَادَ، اللهُمَّ إِذْ هَدَيْتَنِى لِلْإِسْلَامِ فَلَا تَنْزِعْنِى مِنْهُ، وَلَا تَنْزِعْهُ مِنِّى حَتَّى تَقْبِضَنِى وَأَنَا عَلَيْهِ
      """
  ),
  DuaItem(
      title: "Dua_Makkah_To_Mina",
      data: """
      «اللَّهُمَّ إِيَّاكَ أَرْجُو، وَلَكَ أَدْعُو، فَبَلِّغْنِى صَالِحَ أَمَلِى، وَاغْفِرْ لِى ذُنُوبِى، وَامْنُنْ عَلى بِما مَنَنْتَ بِهِ على أَهْلِ طَاعَتِكَ، إِنَّكَ على كل شيء قدير»
      """
  ),
  DuaItem(
      title: "Dua_Arafat_Way",
      data: """
      «اللَّهُمَّ إِلَيْكَ تَوَجَّهْتُ، وَوَجْهَكَ الكَرِيمَ أردتُ، فَاجْعَلْ ذَنْبِى مَغْفُورًا، وَحَجِّى مَبْرُورًا، وارْحَمْنِى وَلَا تُخَيِّبْنِى، إِنَّكَ على كل شيء قدير»
      """
  ),
  DuaItem(
      title: "Dua_Arafat",
      data: """
      لَا إِلَهَ إِلَّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ، وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ
      
      اللَّهُمَّ أَحْيِنِى حَيَاةَ مَنْ تُحِبُّ حَيَاتَهُ، وَبَقَاءَهُ، وَتَوَفَّنِى وَفَاةَ مَنْ تُحِبُّ وَفَاتَهُ وَلِقَاءَهُ، اللَّهُمَّ احْفَظْ عَلَى الرَّأْسَ وَمَا وَعَى اللَّهُمَّ احْفَظْ عَلَى الْبَطْنَ وَمَا حَوَى اللَّهُمَّ احْفَظْ عَلَيْنَا مَا أَمَرْتَنَا بِهِ، وَاحْفَظْنَا عَمَّا نَهَيْتَنَا عَنْهُ، اللَّهُمَّ لَا تَحْرِمْنَا وَنَحْنُ نَسْأَلُكَ، وَلَا تُعَذِّبْنَا وَنَحْنُ نَسْتَغْفِرُكَ، اخْتِمْ آجَالَنَا بِأَحْسَنِ أَعْمَالِنَا، اللَّهُمَّ إِنَّا نَسْأَلُكَ بِجُودِكَ وَبَذْلِكَ وَمَنْكَ وَطَوْلِكَ وَعَظَمَتِكَ وَبَهَائِكَ مَغْفِرَةَ مَا أَحَاطَ بِهِ عِلْمُكَ، يَا مَنْ إِلَيْهِ الْإِيَابُ وَعَلَيْهِ الْحِسَابُ، حَاسِبْنَا حِسَابًا يَسِيرًا، لَا تَقْرِيعَ فِيهِ وَلَا تَأْنِيبَ، وَلَا مُجَازَاةَ وَلَا مُكَافَأَةَ، اللَّهُمَّ أَجِزْنَا الصِّرَاطَ مَعَ الَّذِينَ أَنْعَمْتَ عَلَيْهِمْ مِنَ النَّبِيِّينَ وَالصِّدِّيقِينَ وَالشُّهَدَاءِ وَالصَّالِحِينَ، وَحَسُنَ أُولَئِكَ رَفِيقًا يَا أَرْحَمَ الرَّاحِمِينَ، آمِينَ يَا رَبَّ الْعَالَمِينَ
      
      اللَّهُمَّ بِعِلْمِكَ الْغَيْبَ، وَبِقُدْرَتِكَ عَلَى الْخَلْقِ، أَحْيِنِى مَا عَلِمْتَ الْحَيَاةَ خَيْرًا لِى، وَتَوَفَّنِى إِذَا كَانَتِ الْوَفَاةُ خَيْرًا لِى، اللَّهُمَّ وَأَسْأَلُكَ خَشْيَتَكَ فِى الْغَيْبِ وَالشَّهَادَةِ، وَكَلِمَةَ الْعَدْلِ أو الْحُكْمِ فِى الْغَضَبِ أو الرِّضَا، وَأَسْأَلُكَ الْقَصْدَ فِى الْفَقْرِ وَالْغِنَى، وَأَسْأَلُكَ نَعِيمًا لَا يَبِيدُ، وَأَسْأَلُكَ قُرَّةَ عَيْنٍ لَا تَنْقَطِعُ، وَأَسْأَلُكَ الرِّضَا بَعْدَ الْقَضَاءِ، وَأَسْأَلُكَ بَرْدَ الْعَيْشِ بَعْدَ الموت، وَأَسْأَلُكَ لَذَّةَ النَّظَرِ إلى وَجْهِكَ، وَأَسْأَلُكَ الشَّوْقَ إلى لِقَائِكَ فِى غَيْرِ ضَرَّاءَ مُضِرَّةٍ، وَلَا فِتْنَةٍ مُضِلَّةٍ، اللَّهُمَّ رَبَّنَا زَيَّنَّا بِزِينَةِ الْإِيمَانِ، وَاجْعَلْنَا هُدَاةً مَهْدِيِّينَ
      
      سُبْحَانَكَ وَبِحَمْدِكَ سَرِيعَ الْآلَاءِ، رَاحِمَ الضُّعَفَاءِ، بَارِئَ الْبَرَايَا، خَلَقْتَ الْخَلْقَ لِتَسْبِيحِكَ، سُبْحَانَكَ وَبِحَمْدِكَ، لَا إِلَهَ إِلَّا أَنْتَ، مَدَدْتَ الْأَرْضَ وَحَكَمْتَ بِالْقِسْطِ، وَأَقَمْتَ الْمِيزَانَ، إِلَيْكَ أُدِّى الْحَمْدُ وَارْتَفَعَ إِلَيْكَ ثَمَرُ التَّسْبِيحِ وَصَعِدَ إِلَيْكَ وَقَارُ التَّقْدِيسِ، سُبْحَانَكَ وَبِحَمْدِكَ، لَا إِلَهَ إِلَّا أَنْتَ الْجَبَّارُ، ذُو الْجَبَرُوتِ عَالِمُ الْغَيْبِ وَالشَّهَادَةِ، لَا يَطَّلِعُ عَلَى غَيْبِكَ أَحَدٌ وَلَا يَظْهَرُ مِنْ أَمْرِكَ إِلَّا مَا شِئْتَ، بِيَدِكَ الْمُلْكُ وَالْمَلَكُوتُ، وَبِيَدِكَ الْمَفَاتِيحُ وَالتَّقْدِيرُ، وَبِيَدِكَ مُلْكُ الدُّنْيَا وَالْآخِرَةِ، تَعْلَمُ مَا يَكُونُ وَمَا هُوَ كَائِنٌ، وَمَا فِى ظُلُمَاتِ الْأَرْحَامِ، وَظُلُمَاتِ الْبُحُورِ، تَعَالَيْتَ وَتَجَبَّرْتَ فِى مَجْلِسِ وَقَارِ كُرْسِى عَرْشِكَ، تَرَى كُلَّ عَيْنٍ، وَعَيْنٌ لَا تَرَاكَ، وَتُدْرِكُ كُلَّ شَيْءٍ وَشَيْءٌ لَا يُدْرِكُكَ، تُدْرِكُ الْأَبْصَارَ وَأَنْتَ اللَّطِيفُ الْخَبِيرُ
      
      اللهُمَّ اعْصِمْنِى بِدِينِكَ وَطَوَاعِيَتِكَ وَطَوَاعِيَةِ رَسُولِكَ، اللهُمَّ جَنَّبْنِى حُدُودَكَ، اللهُمَّ اجْعَلْنِى مِمَّنْ يُحِبُّكَ، وَيُحِبُّ مَلَائِكَتَكَ، وَيُحِبُّ رُسُلَكَ، وَيُحِبُّ عِبَادَكَ الصَّالِحِينَ، اللهُمَّ حَبَّيْنِى إِلَيْكَ، وَإِلَى مَلَائِكَتِكَ، وَإِلَى رُسُلِكَ، وَإِلَى عِبَادِكَ الصَّالِحِينَ، اللهُمَّ يَسِّرْنِى لِلْيُسْرَى، وَجَنِّبْنِى الْعُسْرَى، وَاغْفِرْ لِى فِى الْآخِرَةِ وَالْأُولَى، وَاجْعَلْنِى مِنْ أَئِمَّةِ الْمُتَّقِينَ، اللهُمَّ إِنَّكَ قُلْتَ: ﴿ادْعُونِى أَسْتَجِبْ لَكُمْ ﴾ [غافر: ٦٠]، وَإِنَّكَ لَا تُخْلِفُ الْمِيعَادَ، اللهُمَّ إِذْ هَدَيْتَنِى لِلْإِسْلَامِ فَلَا تَنْزِعْنِى مِنْهُ، وَلَا تَنْزِعْهُ مِنِّى حَتَّى تَقْبِضَنِى وَأَنَا عَلَيْهِ
      """
  ),
  DuaItem(
      title: "Dua_Arafat_Night",
      data: """
      اللَّهُمَّ اجْعَلْ لِى فِى سَمْعِى نُورًا، وَفِى بَصَرِى نُورًا، اللَّهُمَّ اغْفِرْ لِى ذَنْبِى، وَيَسِّرْ لِى أَمْرِى، وَاشْرَحْ لِى صَدْرِى، اللَّهُمَّ إِنِّى أَعُوذُ بِكَ مِنْ وَسْوَاسِ الصَّدْرِ، وَمِنْ شَتَاتِ الْأَمْرِ، وَمِنْ عَذَابِ الْقَبْرِ، اللَّهُمَّ إِنِّى أَعُوذُ بِكَ مِنْ شَرِّ مَا يَلِجُ فِى اللَّيْلِ وَشَرِّ مَا يَلِجُ فِى النَّهَارِ، وَشَرِّ مَا تَهُبُّ بِهِ الرِّيَاحُ، وَشَرِّ بَوَائِقِ الدَّهْرِ
      
      اللَّهُمَّ إِنَّكَ تَرَى مَكَانِى، وَتَسْمَعُ كَلَامِى، وَتَعْلَمُ سِرِّى وَعَلَانِيَتِى، لَا يَخْفَى عَلَيْكَ شَيْءٌ مِنْ أَمْرِى، أَنَا الْبَائِسُ الْفَقِيرُ الْمُسْتَغِيثُ الْمُسْتَجِيرُ، الْوَجِلُ الْمُشْفِقُ الْمُقِرُّ الْمُعْتَرِفُ بِذَنْبِهِ، أَسْأَلُكَ مَسْأَلَةَ الْمِسْكِينِ، وَأَبْتَهِلُ إِلَيْكَ ابْتِهَالَ الْمُذْنِبِ الدَّلِيلِ، وَأَدْعُوكَ دُعَاءَ الْخَائِفِ الضَّرِيرِ، مَنْ خَضَعَتْ لَكَ رَقَبَتُهُ، وَذَلَّ جَسَدُهُ، وَرَغِمَ أَنْفُهُ اللَّهُمَّ لَا تَجْعَلْنِى بِدُعَائِكَ شَقِيًّا، وَكُنْ بِى رَؤُوفًا رَحِيمًا، يَا خَيْرَ الْمَسْؤُولِينَ، وَيَا خَيْرَ الْمُعْطِينَ
      """
  ),
  DuaItem(
      title: "Dua_Arafat_To_Muzdalifah",
      data: """
      لا إله إلا الله، والله أكبر». ويكرر ذلك، ويقولُ: «إِلَيْكَ اللَّهُمَّ أَرْغَبُ، وَإِيَّاكَ أَرْجُو، فَتَقَبَّلْ نسكى، وَوَفِّقْنِى وَارْزُقْنِى فِيهِ مِنَ الخَيْرِ أَكْثَرَ ما أَطْلُبُ، وَلَا تُخَيِّبْنى، إِنَّكَ أَنْتَ اللهُ الْجَوَادُ الكَرِيمُ
      
       الذكر والدعاء فى المزدلفة وعند المشعر الحرام

قال الله تعالى: ﴿ فَإِذَا أَفَضْتُم مِّنْ عَرَفَاتٍ فَاذْكُرُوا اللَّهَ عِندَ الْمَشْعَرِ الْحَرَامِ وَاذْكُرُوهُ كَمَا هَدَيْكُمْ وَإِن كُنتُم مِّن قَبْلِهِ لَمِنَ - الضَّالِّينَ ﴾ [البقرة: ١٩٨]      

ومن الدعاء المذكور فى ذلك       

اللَّهُمَّ إنى أسألُكَ أن تَرْزُقَنِى فِى هَذَا المَكَانِ جَوامِعَ الخَيْرِ كُلِّهِ، وَأَنْ تُصْلِح شأنِى كُلَّهُ، وأَنْ تَصْرِفَ عَنِّى الشَّرَّ كُلَّهُ، فَإِنَّهُ لَا يَفْعَلُ ذَلكَ غَيْرُكَ، وَلَا يَجودُ بِهِ إِلَّا أَنْتَ       
      """
  ),
  DuaItem(
      title: "Dua_Jamarat_Throwing",
      data: """
      الله أَكْبَر، الله أَكْبَر، الله أَكْبَر
      
      اللَّهُمَّ اجْعَلْهُ حَجا مَبْرُورًا وَذَنْبًا مَغْفُورًا
      
      اللهُمَّ اعْصِمْنِى بِدِينِكَ وَطَوَاعِيَتِكَ وَطَوَاعِيَةِ رَسُولِكَ، اللهُمَّ جَنِّبْنِى حُدُودَكَ، اللهُمَّ اجْعَلْنِى مِمَّنْ يُحِبُّكَ، وَيُحِبُّ مَلَائِكَتَكَ، وَيُحِبُّ رُسُلَكَ، وَيُحِبُّ عِبَادَكَ الصَّالِحِينَ، اللهُمَّ حَبِّبْنِى إِلَيْكَ، وَإِلَى مَلَائِكَتِكَ، وَإِلَى رُسُلِكَ، وَإِلَى عِبَادِكَ الصَّالِحِينَ، اللهُمَّ يَسِّرْنِى لِلْيُسْرَى، وَجَنِّبْنِى الْعُسْرَى، وَاغْفِرْ لِى فِى الْآخِرَةِ وَالْأُولَى، وَاجْعَلْنِى مِنْ أَئِمَّةِ الْمُتَّقِينَ، اللهُمَّ إِنَّكَ قُلْتَ: ﴿ادْعُونِى أَسْتَجِبْ لَكُمْ ﴾ [غافر: ٦٠]، وَإِنَّكَ لَا تُخْلِفُ الْمِيعَادَ، اللهُمَّ إِذْ هَدَيْتَنِى لِلْإِسْلَامِ فَلَا تَنْزِعْنِى مِنْهُ، وَلَا تَنْزِعْهُ مِنِّى حَتَّى تَقْبِضَنِى وَأَنَا عَلَيْهِ
      
      والسنة أن يقف فى أيام الرمى كل يوم عند الجمرة الأولى إذا رماها، ويستقبل الكعبة، ويحمد الله تعالى، ويُكبّر، ويُهلّل، ويُسبّح، ويدعو مع حضور القلب وخشوع الجوارح، ويمكن كذلك قدر قراءة سورة البقرة، ويفعل فى الجمرة الثانية وهى الوسطى كذلك، ولا يقف عند
الثالثة، وهى جمرة العقبة      
      """
  ),
  DuaItem(
      title: "Dua_Mina_Nahr",
      data: """
      يَا حَى يَا قَيُّومُ لَا إِلَهَ إِلَّا أَنْتَ، بِرَحْمَتِكَ أَسْتَغِيثُ، فَاكْفِنِى شَأْنِى كُلَّهُ، وَلَا تَكِلْنِى إلى نَفْسِى طَرْفَةَ عَيْنٍ
       
       الحمدُ لِلَّهِ الَّذِى بَلَّغَنِيها سالِمًا مُعافى، اللَّهُمَّ هَذِهِ مِنِّى قَدْ أَتيتُها وأنا عبدك وفى قَبْضَتِكَ، أسألُكَ أن تَمُنَّ عَلَى بِمَا مَنَنْتَ به على أوليائِكَ، اللَّهُمَّ إنى أَعُوذُ بِكَ مِنَ الحِرْمَانِ وَالمُصِيبَةِ فِى دِينى، يا أرحم الراحمين
       """
  ),
  DuaItem(
      title: "Dua_Mina_Tashreeq",
      data: """
      قال رسول الله صَلَّى اللَّهُ عَلَيْهِ وَعَلَى آلِهِ وَسَلَّمَ : أَيَّامُ التَّشْرِيقِ أَيَّامُ أَكْلٍ وَشُرْبٍ وَذِكْرِ اللهِ تعالى، فيُستحبُّ الإكثار من الأذكار، وأفضلها قراءة القرآن
      """
  ),
  DuaItem(
      title: "Dua_Hijj_Finishing",
      data: """
      وإذا نفر من مِنّى فقد انقضى حجه، ولم يبق ذكر يتعلق بالحج، لكنه - مسافر، فيستحبُّ له التكبير والتهليل والتحميد والتمجيد وغير ذلك من
      الأذكار المستحبة للمسافرين
      
      الذكر والدُّعَاءُ عِنْدَ وَدَاعِ الْبَيْتِ
      
      يَسْتَحِبُّ للمحرم أن يَدْعُوَ عِنْدَ وَدَاعِ الْبَيْتِ فِى الْمُلْتَزَمِ بَيْنَ الْحِجْرِ وَالْبَابِ فيقول
      
      اللَّهُمَّ اغْفِرْ لِى ذُنُوبِى، وَقَنَّعْنِى بِمَا رَزَقْتَنِى، وَبَارِكْ لِى فِيهِ، وَاخْلُفْ عَلَى كُلِّ غَائِبَةٍ لِى بِخَيْرٍ
      
      دعاء دخول المدينة المنورة
      
      اللَّهُمَّ اجْعَلْ لَنَا بِهَا قَرَارًا، وَرِزْقًا حَسَنًا
      """
  ),
];