class DuaItem {
  String title;
  String description;
  String data;
  DuaItem({required this.title, this.description = "", required this.data});
}

DuaItem duaTravel = DuaItem(
  title: "Dua_Travel",
  data: """
    بسم الله والحمد لله، الله أكبر، الله أكبر، الله أكبر
    سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ
    اللهُمَّ إِنَّا نَسْأَلُكَ فِي سَفَرِنَا هَذَا الْبِرَّ وَالتَّقْوَى
    وَمِنَ الْعَمَلِ مَا تَرْضَى
    اللهُمَّ هَوِّنْ عَلَيْنَا سَفَرَنَا هَذَا، وَاطْوِ عَنَّا بُعْدَهُ
    اللهُمَّ أَنْتَ الصَّاحِبُ فِي السَّفَر، وَالْخَلِيفَةُ فِي الْأَهْلِ
    اللهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ وَعْثَاءِ السَّفَرِ، وَكَآبَةِ الْمَنْظَرِ
    وَسُوءِ الْمُنْقَلَبِ فِي الْمَالِ وَالْأَهْلِ والولد
    
    
    
    وكان إذا رجع قالهن وزاد فيهن قائلًا أيِبُونَ تَائِبُونَ عَابِدُونَ لِرَبِّنَا حَامِدُون
    """,
);
